Revit 2025 API
BoundaryConditionsType Enumeration
 This enum declares type of BoundaryConditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BoundaryConditionsType
Public Enumeration BoundaryConditionsType
public enum class BoundaryConditionsType
type BoundaryConditionsType
Members
Member name | Value | Description
Point | 0 |  Point Boundary Conditions
Line | 1 |  Line Boundary Conditions
Area | 2 |  Area Boundary Conditions
See Also
Reference
Autodesk.Revit.DB.Structure Namespace